{"data":{"site":{"siteMetadata":{"title":"Sean McPherson","author":"Sean McPherson"}},"markdownRemark":{"id":"72db4bec-1ff2-5996-9663-504ee06282c9","excerpt":"After deciding to transition away from Medium and  launch my own blog , the next decision to make was selecting a publishing platform. I…","html":"<p>After deciding to transition away from Medium and <a href=\"/articles/why-a-blog\">launch my own blog</a>, the next decision to make was selecting a publishing platform.</p>\n<p>I have dabbled with creating a custom blogging platform before, leveraging Markdown files and various APIs, but I don’t have confidence in my own ability to make something resilient from scratch in a reasonable time period.</p>\n<p>In looking for a self-hosted platform that would satisfy my needs, I considered the following options:</p>\n<ul>\n<li>Ghost</li>\n<li>Wordpress</li>\n<li>Jekyll</li>\n<li>Gatsby</li>\n</ul>\n<p><strong><del>Ghost</del></strong></p>\n<p>Ghost is a neat little publishing platform about which I have heard good reviews. I would have enjoyed the opportunity to flex my Node muscles when developing. However, I’m not interested in paying for a platform at this time.</p>\n<p><strong><del>Wordpress</del></strong></p>\n<p>Story time: when I was in high school, I started a web design and development company with a classmate. My partner quickly picked up Wordpress development and wanted to use it on all our projects. But try as I might, I couldn’t figure Wordpress out. Feeling like a failure, I stuck to project management and design.</p>\n<p>(That business partner is now a PhD student in California using machine-learning algorithms to identify bird calls. Pretty neat!)</p>\n<p>To this day, Wordpress remains a boogeyman for me. Even though it is a standard on the web, but I wasn’t interested.</p>\n<p><strong><del>Jekyll</del></strong></p>\n<p>Jekyll looks neat and integrates well with GitHub pages. I’m not a huge fan of HTML templating, but they seem to have streamlined things pretty well. But I have never worked in Ruby or with <code class=\"language-text\">gems</code> before and wasn’t looking to dive into something totally new for this project.</p>\n<p><strong>Gatsby</strong></p>\n<p>That left Gatsby, a “blazing fast” React- and GraphQL-powered static site generator. I tinked around with Gatsby a few times in the past but never got anywhere. Now with a real project in mind, I decided to go a little deeper.</p>\n<p>The development process in Gatsby wasn’t perfect, but it felt like a natural step for a React developer. After a week working on a site, I felt ready to deploy and share it with the world.</p>\n<h2>Gatsby pros</h2>\n<h4>Components</h4>\n<p>Utilizing reusable components is second nature at this point and feels more natural than templating.</p>\n<h4>Routing</h4>\n<p>Navigating in a React application can take some configuration, but Gatsby’s routing worked right out of the box. Pass a <code class=\"language-text\">to</code> prop to the <code class=\"language-text\">Link</code> component and you’re off to the races.</p>\n<h4>Hot reloading</h4>\n<p>Other development platforms may have this feature, but it works seamlessly on Gatsby. It made making changes to the template or an individual post fast.</p>\n<h4>GraphQL</h4>\n<p>This is the first project on which I have used GraphQL, and (after a few hiccups) I enjoyed the flexibility it provides. The integrated GraphiQL IDE is a brilliant idea.</p>\n<h2>Gatsby cons</h2>\n<h4>Old docs mixed with new</h4>\n<p>I hesitate to put this under the cons, because the newer Gatsby docs are great. But during the development process I would regularly find myself on an older page was either out-of-date or unclear. I had to modify some code samples taken from the docs in order for things to work correctly.</p>\n<h4>Page generation</h4>\n<p>The process by which Gatsby generates it’s static pages is—at first glance—cryptic. I relied heavily on the documentation (see above) to understand the workings of <code class=\"language-text\">gatsby-node.js</code>, and it was only after a few days that I started to wrap my head around it.</p>\n<h2>Summary</h2>\n<p>Overall, I enjoyed the </p>","frontmatter":{"category":"meta","date":"December 4, 2018","summary":false,"tags":["blogging","gatsby"],"title":"Why Gatsby?"}}},"pageContext":{"slug":"/why-gatsby/"}}